In [ ]:
import pymongo
import matplotlib.pyplot as plt
import numpy as np

In [ ]:
# stringa di connessione 3.4 recuperata da Atlas https://www.mongodb.com/cloud/atlas/register
client = pymongo.MongoClient(
    "mongodb://khaled:33311Ee9@cluster0-shard-00-00.2e0wc.mongodb.net:27017,cluster0-shard-00-01.2e0wc.mongodb.net:27017,cluster0-shard-00-02.2e0wc.mongodb.net:27017/myFirstDatabase?ssl=true&replicaSet=atlas-3iutc4-shard-0&authSource=admin&retryWrites=true&w=majority")
db = client.Elshahat # nome del database

2.Crei un dataframe Pandas contenente le informazioni presenti nella collection

In [ ]:
import pandas as pd
df = pd.DataFrame.from_records(db.ristoranti.find())
df

                            _id  ... restaurant_id
0      619c9bbf2c113f182800709f  ...      40378035
1      619c9bbf2c113f1828007053  ...      40364744
2      619c9bbf2c113f182800707d  ...      40364610
3      619c9bbf2c113f1828007058  ...      40364863
4      619c9bbf2c113f1828007070  ...      40377908
...                         ...  ...           ...
25354  619c9bc42c113f182800d30e  ...      50018545
25355  619c9bc42c113f182800d336  ...      50018589
25356  619c9bc42c113f182800d354  ...      50018892
25357  619c9bc42c113f182800d358  ...      50018594
25358  619c9bc42c113f182800d35a  ...      50018245

[25359 rows x 8 columns]

3. Elimini tutte le colonne ad esclusione di ‘borough’, ‘cuisine’ e ‘name’

In [ ]:
df.drop(columns=['borough','cuisine','name'])

                            _id  ... restaurant_id
0      619c9bbf2c113f182800709f  ...      40378035
1      619c9bbf2c113f1828007053  ...      40364744
2      619c9bbf2c113f182800707d  ...      40364610
3      619c9bbf2c113f1828007058  ...      40364863
4      619c9bbf2c113f1828007070  ...      40377908
...                         ...  ...           ...
25354  619c9bc42c113f182800d30e  ...      50018545
25355  619c9bc42c113f182800d336  ...      50018589
25356  619c9bc42c113f182800d354  ...      50018892
25357  619c9bc42c113f182800d358  ...      50018594
25358  619c9bc42c113f182800d35a  ...      50018245

[25359 rows x 5 columns]

4. Conti il numero di ristoranti che hanno ‘Missing’ come quartiere

In [ ]:
df[df['borough'] == 'Missing'].count()['borough']

51

5. Sostituisca alla parola ‘Missing’ il valore null